---
type: RevitAPIPostEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# RevitAPIPostEventArgs

`Autodesk.Revit.DB.Events.RevitAPIPostEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Status | 2011 | `public RevitAPIEventStatus Status { get ; }` |